# Brewfile.tmpl — SHARED global tools (macOS + Linux/Bluefin)
#
# Runs on every machine via .chezmoiscripts/run_onchange_after_01b-brew-bundle-shared.sh.tmpl.
# Mise is now project-only — global tools live here.
#
# Add OS-specific entries to Brewfile.darwin.tmpl or Brewfile.linux.tmpl.
# To force re-run after edits: chezmoi re-applies on change automatically.
#
# Sources: homebrew/core unless noted.

# ---- taps for non-core formulas ----
tap "hashicorp/tap"     # terraform (left core after BSL relicense)
tap "fluxcd/tap"        # flux (fluxcd v2 — distinct from core's old `flux` v1)
tap "oven-sh/bun"       # bun runtime
tap "databricks/tap"    # databricks CLI

# ---- core CLI ----
brew "age"
brew "awscli"
brew "aws-nuke"
brew "aws-vault"
brew "backlog-md"       # Markdown-native task manager & Kanban for git repos
brew "bat"
brew "btop"
brew "chezmoi"
brew "cloudflared"
brew "direnv"
brew "docker-compose"
brew "doppler"
brew "doggo"
brew "eza"
brew "fd"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "gitui"
brew "go"
brew "gum"
brew "k9s"
brew "kind"
brew "kubernetes-cli"   # provides `kubectl`
brew "kubeseal"
brew "lazydocker"
brew "lazygit"
brew "navi"
brew "neovim"           # NOTE: brew tracks latest; pin to 0.11.4 lost in migration
brew "opencode"
brew "pandoc"
brew "ripgrep"
# REMOVED 2026-07-17: brew "rtk" — LLM token-saving CLI proxy. Do NOT re-add.
#   Its agent rewrite silently swapped `rg` -> `rtk grep`, which use DIFFERENT regex
#   dialects (rg = ERE, `|` is alternation; rtk grep = BRE, `|` is a literal char).
#   So `rg 'a|b'` returned 0 matches, exit 0, no error — a silent false negative in
#   the agent's primary search tool. Unsound by construction; no rtk version fixes it.
#   Upstream siblings: rtk-ai/rtk #2647, #1436, #236, #838, #1282. The paired
#   run_onchange_after_02b-configure-rtk.sh.tmpl was deleted in the same change.
brew "starship"         # NOTE: brew tracks latest; pin to 1.23.0 lost in migration
brew "swag"
brew "typst"
brew "uv"
brew "yazi"
brew "yq"
brew "zellij"
brew "zoxide"

# ---- version-pinned languages ----
brew "node@22"          # was mise node=22.21.0
brew "python@3.12"      # was mise python=3.12.12

# ---- tapped ----
brew "hashicorp/tap/terraform"
brew "fluxcd/tap/flux"  # was mise flux2
brew "oven-sh/bun/bun"
brew "databricks/tap/databricks"
# ---- AI CLIs ----
# Claude Code comes from Bun globals (@anthropic-ai/claude-code) so it tracks npm releases.
cask "codex"
